public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
    ///Рецепт 1
               {
        "name": "Сырники из творога",
            "ingredients";
        {
            "name": "Творог",
                "weigth": 350,
                "measureUnit": "г."
        }
        {
            "name": "Куриное яйцо",
                "weigth": 2,
                "measureUnit": "шт."
        }
        {
            "name": "Пшеничная мука",
                "weigth": 6,
                "measureUnit": "ст.л."
        }
        {
            "name": "Сахар",
                "weigth": 2,
                "measureUnit": "ст.л."
        }
]
        "steps":{
        "1": "Смешать весь творог с яйцами, сахаром, перемешать",
                "2": "Всыпать в творог муку и перемешать",
                "3": "Поставить сковороду на огонь и влить водсолнечное масло",
                "4": "Слепить шарики из творожной массы и положить на тарелку",
                "5": "Обжарить сырники 1-2 минуту",
                "6": "Повторить, поа творог не закончится".
    }
    }
]

    ///Рецепт 2

    {
        "name": "Салат из красной фасоли с творожным сыром, красным луком и сезонным салатом",
            "ingredients"; [
        {
            "name": "Консервированная фасоль",
                "weigth": 400,
                "measureUnit": "г."
        }
        {
            "name": "Специи",
                "weigth": по вкусу,
            "measureUnit": "г."
        }
        {
            "name": "Лимон",
                "weigth": 1,
                "measureUnit": "шт."
        }
        {
            "name": "Чеснок",
                "weigth": 2,
                "measureUnit": "зуб."
        }
        {
            "name": "Рукола",
                "weigth": 100,
                "measureUnit": "г."
        }
        {
            "name": "Красный лук",
                "weigth": 50,
                "measureUnit": "г."
        }
        {

            "name": "Творожный сыр",
                "weigth": 200,
                "measureUnit": "г."
        }
        {
            "name": "Оливковое масло",
                "weigth": 50,
                "measureUnit": "мл."
        }

        "steps":{
        "1": "Открыть две банки фасоли, слить сок и промыть фасоль холодной водой",
                "2": "Готовую фасоль смешать с луком, зеленью, чесноком, маслом, лимонным соком и творожным сыром",
                "3": "Посолить, поперчить, дать продуктам 2 минуты притереться друг к другу".
    }
    }
]


   /// Рецепт 3

                {
        "name": "Чечевичный суп с мятой",
            "ingredients"; [
        {
            "name": "Красная чечевица",
                "weigth": 150,
                "measureUnit": "г."
        }
        {
            "name": "Лук репчатый",
                "weigth": 1,
                "measureUnit": "шт."
        }
        {
            "name": "Морковь",
                "weigth": 1,
                "measureUnit": "шт."
        }
        {
            "name": "Подсолнечное масло",
                "weigth": 30,
                "measureUnit": "мл."
        }
        {
            "name": "Сливочное масло",
                "weigth": 15,
                "measureUnit": "г."
        }
        {
            "name": "Пшеничная мука",
                "weigth": 30,
                "measureUnit": "г."
        }
        {
            "name": "Сливки 33%",
                "weigth": 50,
                "measureUnit": "мл."
        }
        {
            "name": "Лимон",
                "weigth": 1/2,
                "measureUnit": "шт."
        }
]
        "steps":{
        "1": "В кастрюлю налить воды и засыпать чечевицу",
                "2": "Натереть небольшую морковь на крупной терке, мелко нарезать лук.
        Как только чечевица начнет кипеть, надо убавить огонь, а затем долить еще 200 мл воды или бульона.
        Варить еще десять минут",
        "3": "Разогреть широкую плоскую сковороду, добавить туда подсолнечное и сливочное масло.
        Обжарить лук и морковь",
        "4": "Добавить обжаренные овощи в кастрюлю, влить сливки.Взбить суп блендером. Подавать суп".
    }
    }
]


    ///Рецепт 4

            [
    {
        "name": "Салат с креветками и кунжутом",
            "ingredients"; [
        {
            "name": "Помидоры",
                "weigth": 3,
                "measureUnit": "шт."
        }
        {
            "name": "Креветки королевские",
                "weigth": 300,
                "measureUnit": "г."
        }
        {
            "name": "Салат зеленый",
                "weigth": 1,
                "measureUnit": "шт."
        }
        {
            "name": "Огурцы",
                "weigth": 2,
                "measureUnit": "шт."
        }
        {
            "name": "Семечки кунжутные",
                "weigth": 3,
                "measureUnit": "ст.л."
        }
]
        "steps":{
        "1": "Порезать овощи крупно, салат порвать на куски",
                "2": "Довести до кипения сильно соленую воду и добавить креветки. После кипения варить 5 минут",
                "3": "Очистить креветки от панциря",
                "4": "Смешать овощи и креветки",
                "5": "Посыпать кунжутными семечками и заправить майонезом".
    }
    }
]


   /// Рецепт 5

            [
    {
        "name": "Творожные пончики в сахарной пудре",
            "ingredients"; [
        {
            "name": "Творог",
                "weigth": 250,
                "measureUnit": "г."
        }
        {
            "name": "Куриное яйцо",
                "weigth": 3,
                "measureUnit": "шт."
        }
        {
            "name": "Пшеничная мука",
                "weigth": 8,
                "measureUnit": "ст.л."
        }
        {
            "name": "Сода",
                "weigth": 1/2,
                "measureUnit": "ч.л."
        }
        {
            "name": "Семечки кунжутные",
                "weigth": 3,
                "measureUnit": "ст.л."
        }
]
        "steps":{
        "1": "В миске смешать творог, яйца, муку, сахар, соду и соль до однородной массы",
                "2": "Разогреть в сотейнике оливковое масло",
                "3": "При помощи чайной ложки или руками скатать из теста шарики,
        каждый размером чуть меньше грецкого орех",
        "4": "Бросить пончики в кипящее масло и жарить на небольшом огне, постоянно переворачивая шумовкой",
                "5": "Готовые пончики выложить на бумажное полотенце и оставить на одну-две минуты —
        чтобы оно впитало лишнее масло. Подавать пончики горячими".
    }
    }
]
}